In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%sql sqlite:///string_function.db

In [4]:
%%sql

SELECT name
FROM sqlite_master
WHERE type = 'table'

 * sqlite:///string_function.db
Done.

[('books',)]

In [5]:
%sql SELECT * FROM Books;

 * sqlite:///string_function.db
Done.

[(1, 'The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
 (2, 'Norse Mythology', 'Neil', 'Gaiman', 2016, 43, 304),
 (3, 'American Gods', 'Neil', 'Gaiman', 2001, 12, 465),
 (4, 'Interpreter of Maladies', 'Jhumpa', 'Lahiri', 1996, 97, 198),
 (5, 'A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
 (6, 'The Circle', 'Dave', 'Eggers', 2013, 26, 504),
 (7, 'The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
 (8, 'Just Kids', 'Patti', 'Smith', 2010, 55, 304),
 (9, 'A Heartbreaking Work of Staggering Genius', 'Dave', 'Eggers', 2001, 104, 437),
 (10, 'Coraline', 'Neil', 'Gaiman', 2003, 100, 208),
 (11, 'What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
 (12, "Where I'm Calling From: Selected Stories", 'Raymond', 'Carver', 1989, 12, 526),
 (13, 'White Noise', 'Don', 'DeLillo', 1985, 49, 320),
 (14, 'Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
 (15, 'Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
 (16, 'Consider the Lobster', 'David', 'Foster Wallace', 2005, 92, 343)]

In [10]:
%%sql
INSERT INTO books
(book_id,title,author_fname,author_lname,released_year,stock_quantity,pages)
VALUES (17,'10% Happier', 'Dan', 'Harris', 2014, 29, 256),
(18,'fake_book', 'Freida', 'Harris', 2001, 287, 428),
(19,'Lincoln In The Bardo', 'George', 'Saunders', 2017, 1000, 367);

 * sqlite:///string_function.db
3 rows affected.

[]

#### **DISTINCT** ####

In [ ]:
%sql SELECT DISTINCT author_fname, author_lname FROM books;

 * sqlite:///string_function.db
Done.

[('Jhumpa', 'Lahiri'),
 ('Neil', 'Gaiman'),
 ('Dave', 'Eggers'),
 ('Michael', 'Chabon'),
 ('Patti', 'Smith'),
 ('Raymond', 'Carver'),
 ('Don', 'DeLillo'),
 ('John', 'Steinbeck'),
 ('David', 'Foster Wallace'),
 ('Dan', 'Harris'),
 ('Freida', 'Harris'),
 ('George', 'Saunders')]

In [18]:
%sql SELECT DISTINCT author_fname FROM books;

 * sqlite:///string_function.db
Done.

[('Jhumpa',),
 ('Neil',),
 ('Dave',),
 ('Michael',),
 ('Patti',),
 ('Raymond',),
 ('Don',),
 ('John',),
 ('David',),
 ('Dan',),
 ('Freida',),
 ('George',)]

In [19]:
%sql SELECT DISTINCT author_fname, title FROM books;

 * sqlite:///string_function.db
Done.

[('Jhumpa', 'The Namesake'),
 ('Neil', 'Norse Mythology'),
 ('Neil', 'American Gods'),
 ('Jhumpa', 'Interpreter of Maladies'),
 ('Dave', 'A Hologram for the King: A Novel'),
 ('Dave', 'The Circle'),
 ('Michael', 'The Amazing Adventures of Kavalier & Clay'),
 ('Patti', 'Just Kids'),
 ('Dave', 'A Heartbreaking Work of Staggering Genius'),
 ('Neil', 'Coraline'),
 ('Raymond', 'What We Talk About When We Talk About Love: Stories'),
 ('Raymond', "Where I'm Calling From: Selected Stories"),
 ('Don', 'White Noise'),
 ('John', 'Cannery Row'),
 ('David', 'Oblivion: Stories'),
 ('David', 'Consider the Lobster'),
 ('Dan', '10% Happier'),
 ('Freida', 'fake_book'),
 ('George', 'Lincoln In The Bardo')]

#### **ORDER BY** ####

In [ ]:
%sql SELECT DISTINCT author_fname, title FROM books ORDER BY author_fname, title, stock_quantity;

 * sqlite:///string_function.db
Done.

[('Dan', '10% Happier'),
 ('Dave', 'A Heartbreaking Work of Staggering Genius'),
 ('Dave', 'A Hologram for the King: A Novel'),
 ('Dave', 'The Circle'),
 ('David', 'Consider the Lobster'),
 ('David', 'Oblivion: Stories'),
 ('Don', 'White Noise'),
 ('Freida', 'fake_book'),
 ('George', 'Lincoln In The Bardo'),
 ('Jhumpa', 'Interpreter of Maladies'),
 ('Jhumpa', 'The Namesake'),
 ('John', 'Cannery Row'),
 ('Michael', 'The Amazing Adventures of Kavalier & Clay'),
 ('Neil', 'American Gods'),
 ('Neil', 'Coraline'),
 ('Neil', 'Norse Mythology'),
 ('Patti', 'Just Kids'),
 ('Raymond', 'What We Talk About When We Talk About Love: Stories'),
 ('Raymond', "Where I'm Calling From: Selected Stories")]

In [ ]:
%sql SELECT DISTINCT author_fname, title FROM books ORDER BY stock_quantity;

 * sqlite:///string_function.db
Done.

[('Neil', 'American Gods'),
 ('Raymond', "Where I'm Calling From: Selected Stories"),
 ('Raymond', 'What We Talk About When We Talk About Love: Stories'),
 ('Dave', 'The Circle'),
 ('Dan', '10% Happier'),
 ('Jhumpa', 'The Namesake'),
 ('Neil', 'Norse Mythology'),
 ('Don', 'White Noise'),
 ('Patti', 'Just Kids'),
 ('Michael', 'The Amazing Adventures of Kavalier & Clay'),
 ('David', 'Consider the Lobster'),
 ('John', 'Cannery Row'),
 ('Jhumpa', 'Interpreter of Maladies'),
 ('Neil', 'Coraline'),
 ('Dave', 'A Heartbreaking Work of Staggering Genius'),
 ('Dave', 'A Hologram for the King: A Novel'),
 ('David', 'Oblivion: Stories'),
 ('Freida', 'fake_book'),
 ('George', 'Lincoln In The Bardo')]

In [ ]:
%sql SELECT DISTINCT author_fname, title FROM books ORDER BY stock_quantity DESC;

 * sqlite:///string_function.db
Done.

[('George', 'Lincoln In The Bardo'),
 ('Freida', 'fake_book'),
 ('David', 'Oblivion: Stories'),
 ('Dave', 'A Hologram for the King: A Novel'),
 ('Dave', 'A Heartbreaking Work of Staggering Genius'),
 ('Neil', 'Coraline'),
 ('Jhumpa', 'Interpreter of Maladies'),
 ('John', 'Cannery Row'),
 ('David', 'Consider the Lobster'),
 ('Michael', 'The Amazing Adventures of Kavalier & Clay'),
 ('Patti', 'Just Kids'),
 ('Don', 'White Noise'),
 ('Neil', 'Norse Mythology'),
 ('Jhumpa', 'The Namesake'),
 ('Dan', '10% Happier'),
 ('Dave', 'The Circle'),
 ('Raymond', 'What We Talk About When We Talk About Love: Stories'),
 ('Neil', 'American Gods'),
 ('Raymond', "Where I'm Calling From: Selected Stories")]

##### ORDER BY NUMBER OF COLUMN #####

In [34]:
%sql SELECT DISTINCT author_fname, title FROM books ORDER BY 2;

 * sqlite:///string_function.db
Done.

[('Dan', '10% Happier'),
 ('Dave', 'A Heartbreaking Work of Staggering Genius'),
 ('Dave', 'A Hologram for the King: A Novel'),
 ('Neil', 'American Gods'),
 ('John', 'Cannery Row'),
 ('David', 'Consider the Lobster'),
 ('Neil', 'Coraline'),
 ('Jhumpa', 'Interpreter of Maladies'),
 ('Patti', 'Just Kids'),
 ('George', 'Lincoln In The Bardo'),
 ('Neil', 'Norse Mythology'),
 ('David', 'Oblivion: Stories'),
 ('Michael', 'The Amazing Adventures of Kavalier & Clay'),
 ('Dave', 'The Circle'),
 ('Jhumpa', 'The Namesake'),
 ('Raymond', 'What We Talk About When We Talk About Love: Stories'),
 ('Raymond', "Where I'm Calling From: Selected Stories"),
 ('Don', 'White Noise'),
 ('Freida', 'fake_book')]

#### **LIMIT** ####

In [35]:
%sql SELECT DISTINCT author_fname, title FROM books LIMIT 5;

 * sqlite:///string_function.db
Done.

[('Jhumpa', 'The Namesake'),
 ('Neil', 'Norse Mythology'),
 ('Neil', 'American Gods'),
 ('Jhumpa', 'Interpreter of Maladies'),
 ('Dave', 'A Hologram for the King: A Novel')]

In [37]:
%sql SELECT DISTINCT author_fname, title, released_year FROM books ORDER BY released_year LIMIT 5;

 * sqlite:///string_function.db
Done.

[('John', 'Cannery Row', 1945),
 ('Raymond', 'What We Talk About When We Talk About Love: Stories', 1981),
 ('Don', 'White Noise', 1985),
 ('Raymond', "Where I'm Calling From: Selected Stories", 1989),
 ('Jhumpa', 'Interpreter of Maladies', 1996)]

In [40]:
%sql SELECT DISTINCT author_fname, title, released_year FROM books ORDER BY released_year LIMIT 1,5;

 * sqlite:///string_function.db
Done.

[('Raymond', 'What We Talk About When We Talk About Love: Stories', 1981),
 ('Don', 'White Noise', 1985),
 ('Raymond', "Where I'm Calling From: Selected Stories", 1989),
 ('Jhumpa', 'Interpreter of Maladies', 1996),
 ('Michael', 'The Amazing Adventures of Kavalier & Clay', 2000)]

#### **LIKE** ####

In [46]:
%sql SELECT title FROM books WHERE title = 'White Noise'

 * sqlite:///string_function.db
Done.

[('White Noise',)]

In [47]:
%sql SELECT title FROM books WHERE title LIKE '%mala%'

 * sqlite:///string_function.db
Done.

[('Interpreter of Maladies',)]

#### UNDERSCORES WILDCARDS ####
#### ____ ####
- WILD Underscores exacly _ number of caracters

In [49]:
%sql SELECT author_fname FROM books WHERE author_fname LIKE '____'

 * sqlite:///string_function.db
Done.

[('Neil',), ('Neil',), ('Dave',), ('Dave',), ('Dave',), ('Neil',), ('John',)]

In [50]:
%sql SELECT author_fname FROM books WHERE author_fname LIKE '%a_'

 * sqlite:///string_function.db
Done.

[('Dan',)]

In [51]:
%sql SELECT * FROM books WHERE author_fname LIKE '%n'

 * sqlite:///string_function.db
Done.

[(13, 'White Noise', 'Don', 'DeLillo', 1985, 49, 320),
 (14, 'Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
 (17, '10% Happier', 'Dan', 'Harris', 2014, 29, 256)]

#### **ESCAPING WILDCARDS** ####

In [54]:
%sql SELECT * FROM books WHERE title LIKE '%\%%';

 * sqlite:///string_function.db
Done.

[]